       identification division.
       program-id. Test-03.
       environment division.
       data division.
           working-storage section.
           77 a pic 99.
       procedure division.
           display "Masukkan angka A :"
           accept a.

           display "angka yang anda masukan adalah ", a.
