       PROGRAM-ID. TEST-01.

       ENVIRONMENT DIVISION.


       DATA DIVISION.

       PROCEDURE DIVISION.

            display "Hello world".
            display "This is my first cobol program"
            STOP RUN.
